; domain
(define
    (domain pacman_hard)
    (:requirements :strips :typing :equality :adl)

    (:types
        cell
    )

    (:predicates
        (move ?from ?to - cell)
        (at ?pos - cell)
        (connected ?start ?end - cell)
        (has-ghost ?pos - cell)
        (has-food ?pos - cell)
        (has-capsule ?pos - cell)
        (one-capsule-effect-remaining)
        (two-capsule-effects-remaining)
    )


    (:action move
        :parameters (?from ?to - cell)
        :precondition (and
            (at ?from)
            (connected ?from ?to)
            (or
                (not (has-ghost ?to))
                (and
                    (has-ghost ?to)
                    (one-capsule-effect-remaining)
                )
                (and
                    (has-ghost ?to)
                    (two-capsule-effects-remaining)
                )
            )
        )
        :effect (and
            (at ?to)
            (not (at ?from))
            (not (has-food ?to))
            (not (has-capsule ?to))
            (when
                (has-capsule ?to)
                (two-capsule-effects-remaining)
            )
            (when
                (two-capsule-effects-remaining)
                (and
                    (not (has-ghost ?to))
                    (not (two-capsule-effects-remaining))
                    (one-capsule-effect-remaining)
                )
            )
            (when
                (one-capsule-effect-remaining)
                (and
                    (not (has-ghost ?to))
                    (not (one-capsule-effect-remaining))
                )
            )
        )
    )
)

; problem
(define
    (problem pacman-level-1)
    (:domain pacman_hard)

;; problem map
;;  | 1 | 2 | 3 | 4 | 5 |
;; -|---|--- ---|---|---|
;; a| P | _ | _ | G | F |
;; b| _ | C | _ | G | C |
;;  |---|---|---|---|---|

  



    (:objects
        a1 a2 a3 a4 a5 b1 b2 b3 b4 b5 - cell
	)

	(:init
        (at a1)
        (has-capsule b2)
        (has-capsule b5)
        (has-ghost a4)
        (has-ghost b4)
        (has-food a5)
        (connected a1 a2) (connected a1 b1)
        (connected a2 a1) (connected a2 a3) (connected a2 b2)
        (connected a3 a2) (connected a3 a4) (connected a3 b3)
        (connected a4 a3) (connected a4 a5) (connected a4 b4)
        (connected a5 a4) (connected a5 b5)
        (connected b1 b2) (connected b1 a1)
        (connected b2 b1) (connected b2 b3) (connected b2 a2)
        (connected b3 b2) (connected b3 b4) (connected b3 a3)
        (connected b4 b3) (connected b4 b5) (connected b4 a4)
        (connected b5 b4) (connected b5 a5)
	)

    (:goal
        (and
            (not (has-food a1))
            (not (has-food a2))
            (not (has-food a3))
            (not (has-food a4))
            (not (has-food a5))
            (not (has-food b1))
            (not (has-food b2))
            (not (has-food b3))
            (not (has-food b4))
            (not (has-food b5))
            (not (has-ghost a1))
            (not (has-ghost a2))
            (not (has-ghost a3))
            (not (has-ghost a4))
            (not (has-ghost a5))
            (not (has-ghost b1))
            (not (has-ghost b2))
            (not (has-ghost b3))
            (not (has-ghost b4))
            (not (has-ghost b5))
        )
	)
)

; plan
1. (move a1 b1)
   deleted: (at a1)
   added: (at b1)
   goals met: 17 of 20
2. (move b1 b2)
   deleted: (at b1) (has-capsule b2)
   added: (at b2) (two-capsule-effects-remaining)
   goals met: 17 of 20
3. (move b2 b3)
   deleted: (at b2) (two-capsule-effects-remaining)
   added: (at b3) (one-capsule-effect-remaining)
   goals met: 17 of 20
4. (move b3 b4)
   deleted: (at b3) (has-ghost b4) (one-capsule-effect-remaining)
   added: (at b4)
   goals met: 18 of 20
5. (move b4 b5)
   deleted: (at b4) (has-capsule b5)
   added: (at b5) (two-capsule-effects-remaining)
   goals met: 18 of 20
6. (move b5 a5)
   deleted: (at b5) (has-food a5) (two-capsule-effects-remaining)
   added: (at a5) (one-capsule-effect-remaining)
   goals met: 19 of 20
7. (move a5 a4)
   deleted: (at a5) (has-ghost a4) (one-capsule-effect-remaining)
   added: (at a4)
   goals met: 20 of 20
